// 무한이동 클릭형 배너 JS - index.js


////// 제이쿼리 블록 /////////////////
$(() => {

    // 호출확인
    console.log("로딩완료!");

    /************************************ 
        [ 가로방향 배너 요구사항 ]

        1. 오른쪽 버튼 클릭시 배너는 오른쪽에서
        왼쪽방향으로 이동하여 다음 슬라이드가 보임

        2. 왼쪽버튼 클릭시 배너는 왼쪽에서
        오른쪽방향으로 이동하여 이전 슬라이드가 보임

        3. 모든 배너는 무한이동을 원칙으로 한다!

        4. 배너이동시 배너의 순번을 블릿으로 표시한다

        5. 자동넘김이 셋팅되어 있으며 사용자가 조작시
        자동넘김이 멈춰지고 일정시간 놔두면 다시 자동넘김작동함

    ************************************/


    // 이벤트 대상: .abtn
    // 이벤트 : click() 메서드 사용
    // 양쪽버튼 구분 : .lb(왼쪽버튼) / .rb(오른쪽버튼)
    // 변경대상: #viewer ul
    // 변경내용: 슬라이드의 left값을 이동하여 애니메이션함!
    

}); ////////////////// jQB ////////////////////
///////////////////////////////////////////////