<?php
########################################
########## 아이디 중복검사 ###############
########################################

// 아이디 받기 
$mid = $_POST["mid"];

//echo $mid;

// 조회 쿼리 만들기
$sql = "SELECT COUNT(*) FROM `member` WHERE `mid` = '$mid'";

//echo $sql;

##### DB연결 문자열 #######
include "dbcon.inc";

// 쿼리를 DB에 실행 ///
$res = $conn->query($sql);

// 검색결과가 있으면 실행결과 가져오기!
// num_rows는 결과 레코드 개수를 리턴함!
if($res->num_rows>0){// 검색결과가 있으면
    $row = $res->fetch_array();
    //실행결과를 가져옴
    // fetch_array() 메서드는 배열번호를 사용가능
    // 첫번째 결과값이 0번이다! $row[0]
    // 조회결과를 count로 개수를 리턴해줌!
    // 1이면 1개 있는것, 0이면 그런 아이디 없는것!
} /////////// if ////////////////////////////

//echo $row[0];

//// 메시지 결과 분기문 ///////////
/// $row[0] == 0 이면 데이터가 없다는 뜻 : 사용가능 아이디!!!
if($row[0]==0){echo "ok";}// 사용가능한 ID입니다!
else{echo "no";} // 사용중인 ID입니다!

//// DB연결 닫기 ////
$conn->close();






?>