// 프로그레스 페이지 JS - progress.js

$(()=>{////////////// jQB ///////////////////////

    // 1. 로딩확인
    console.log("로딩완료!");

    // 2. 변수셋팅
    // 2-1. 변경대상 바박스 : .lbar
    const lbar = $(".lbar");
    // 2-2. 변경대상 숫자박스 : .ltxt b
    const ltxt = $(".ltxt b");

    // 3. 팽수2 버튼 클릭시
    // .lineper 박스의 .lbar의 width크기를
    // %숫자 증가와 매칭하여 보여주기!
    // 클릭대상: .act button -> 마지막버튼
    $(".act button").last()
    .click(()=>{
        // 1. 숫자 데이터 증가하기
        chgPer();
    }); ////////// click ///////////////

    /*************************************** 
        함수명: chgPer
        기능: 숫자%변경 및 바%변경하기
    ***************************************/
   function chgPer(){
        // 1. 호출확인!
        console.log("%변경중!");

   } /////////////// chgPer함수 //////////////



}); ///////////////// jQB ///////////////////////
