// 쇼핑몰 배너 JS - 02.세로방향 배너 슬라이드 //


////// 제이쿼리 블록 /////////////////
$(() => {

    // 호출확인
    console.log("로딩완료!");

    /************************************ 
        [ 세로방향 배너 요구사항 ]

        1. 아랫쪽 버튼 클릭시 배너는 아랫쪽에서
        윗쪽방향으로 이동하여 다음 슬라이드가 보임

        2. 윗쪽버튼 클릭시 배너는 윗쪽에서
        아랫쪽방향으로 이동하여 이전 슬라이드가 보임

        3. 모든 배너는 무한이동을 원칙으로 한다!

        4. 배너이동시 배너의 순번을 블릿으로 표시한다

        5. 자동넘김이 셋팅되어 있으며 사용자가 조작시
        자동넘김이 멈춰지고 일정시간 놔두면 다시 자동넘김작동함

    ************************************/


    // 이벤트 대상: .abtn
    // 이벤트 : click() 메서드 사용
    // 양쪽버튼 구분 : .ab1(왼쪽버튼) / .ab2(오른쪽버튼)
    // 변경대상: #slide
    // 변경내용: 슬라이드의 left값을 이동하여 애니메이션함!
    

}); ////////////////// jQB ////////////////////
///////////////////////////////////////////////